In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect
from flask import Flask, jsonify
import numpy as np
import psycopg2
import requests
from config import api_key
from config import p_key

In [2]:
#AverageIncome file#
inc_file = "AverageIncome.csv"
inc_data_df = pd.read_csv(inc_file)

#Census columns = S1901_C03_012E, S1901_C04_001E

cleandata= inc_data_df[['NAME', 'S1901_C03_012E','S1901_C04_012E']]

#Renaming the columns
cleandata_transformed = cleandata.rename(columns={"NAME": "name",
                                                          "S1901_C03_012E": "Married Family Income",
                                                          "S1901_C04_012E": "Nonfamily Income"})
cleandata_transformed

,name,Married Family Income,Nonfamily Income
0,Geographic Area Name,Estimate!!Married-couple families!!Median inco...,Estimate!!Nonfamily households!!Median income ...
1,Alabama,78805,26208
2,Alaska,102840,49061
3,Arizona,81830,38032
4,Arkansas,71629,26682
...,...,...,...
568,"Youngstown-Warren-Boardman, OH-PA Metro Area",76266,28248
569,"Yuba City, CA Metro Area",76119,35283
570,"Yuma, AZ Metro Area",55525,29631
571,"Zanesville, OH Micro Area",73074,28409
572,United States,91348,37004

In [3]:
#Check for duplicates
city_column = cleandata_transformed["name"].str.split(",", n =1, expand = True) 
cleandata_transformed["City"]= city_column[0]
cleandata_transformed["state"]= city_column[1]
cleandata_transformed["State"]= cleandata_transformed["state"].str.slice(stop=3)
#Getting rid of unneeded rows with just states because we want cities
census_clean = cleandata_transformed.dropna().reset_index().drop(columns = ['name', 'state', 'index'])
census_clean

    Married Family Income Nonfamily Income                        City State
0                   66894            24470                    Aberdeen    WA
1                   76327            31515                     Abilene    TX
2                   76768            27484                      Adrian    MI
3                   26366            10876           Aguadilla-Isabela    PR
4                   94742            34936                       Akron    OH
..                    ...              ...                         ...   ...
514                 90574            36159                York-Hanover    PA
515                 76266            28248  Youngstown-Warren-Boardman    OH
516                 76119            35283                   Yuba City    CA
517                 55525            29631                        Yuma    AZ
518                 73074            28409                  Zanesville    OH

[519 rows x 4 columns]

In [8]:
#Cost of living file
inc_file = "Costofliving.csv"
inc_data_df = pd.read_csv(inc_file)

#cleaning second file data
costdata_0= inc_data_df[['City', 
     'Cost of Living Index',
     'Rent Index',
     'Groceries Index']]
costdata = pd.DataFrame(costdata_0)

city_column = costdata_0["City"].str.split(",",expand = True) 
costdata["City"]= city_column[0]
costdata["State"]= city_column[1]
costdata["Country"]= city_column[2]
costdata

,City,Cost of Living Index,Rent Index,Groceries Index,State,Country
0,Hamilton,137.56,103.03,126.56,Bermuda,None
1,Zurich,128.65,62.62,127.35,Switzerland,None
2,Basel,126.89,46.14,120.44,Switzerland,None
3,Lausanne,119.62,50.35,116.35,Switzerland,None
4,Bern,118.42,39.22,114.54,Switzerland,None
...,...,...,...,...,...,...
531,Vadodara,22.28,3.78,22.26,India,None
532,Kochi,21.73,5.45,21.93,India,None
533,Visakhapatnam,21.52,4.26,21.09,India,None
534,Navi Mumbai,19.30,4.70,19.21,India,None
535,Thiruvananthapuram,19.26,4.69,18.14,India,None

In [9]:
#filter data for US cities only

new_df = costdata.query('Country==" United States"')
Cost_of_living_us = new_df.reset_index().drop(columns = ['Country', 'index'])
Cost_of_living_us

              City  Cost of Living Index  Rent Index  Groceries Index State
0         New York                100.00      100.00           100.00    NY
1    San Francisco                 96.88      106.49           101.93    CA
2         Honolulu                 93.72       63.96            96.32    HI
3        Anchorage                 93.19       39.45            96.74    AK
4         Brooklyn                 90.31       81.02            83.16    NY
..             ...                   ...         ...              ...   ...
105     Huntsville                 59.80       28.65            58.83    AL
106      Lexington                 59.64       24.86            54.50    KY
107          Boise                 59.43       30.85            50.93    ID
108        El Paso                 59.37       22.16            54.07    TX
109    San Antonio                 58.12       31.26            55.20    TX

[110 rows x 5 columns]

In [10]:
#Find temperature max, min and humidity for these US cities
url = "http://api.openweathermap.org/data/2.5/weather?"
units = "imperial"

# Build partial query URL
query_url = f"{url}appid={api_key}&units={units}&q="

In [11]:
cities = Cost_of_living_us["City"]
# set up lists to hold reponse info

Max_temp = []
Min_temp = []
Humidity =[]

# Loop through the list of cities and perform a request for data on each
for city in cities:
    response = requests.get(query_url + city).json()
    Max_temp.append(response['main']['temp_max'])
    Min_temp.append(response['main']['temp_min'])
    Humidity.append(response['main']['humidity'])

In [12]:
# create a data frame from cities, lat, and temp
weather_dict = {
    "City": cities,
    "Maximum Temp": Max_temp,
    "Minimum Temp": Min_temp,
    "% Humidity": Humidity
}
weather_data = pd.DataFrame(weather_dict)
weather_data

              City  Maximum Temp  Minimum Temp  % Humidity
0         New York         62.69         46.92          82
1    San Francisco         64.45         50.72          75
2         Honolulu         84.02         78.31          61
3        Anchorage         40.93         34.65          65
4         Brooklyn         62.60         45.86          84
..             ...           ...           ...         ...
105     Huntsville         63.95         60.98          89
106      Lexington         62.73         58.93          70
107          Boise         57.02         51.71          41
108        El Paso         58.82         52.66          16
109    San Antonio         64.92         52.52          29

[110 rows x 4 columns]

In [13]:
#Create connection to postgres. A database called Cost_living was created in postgres

engine = create_engine(f'postgresql://postgres:{p_key}@localhost:5432/Cost_Living') 
connection = engine.connect()

In [14]:
#Create table 1 (cost_index) in postgres database "Cost_Living"
Cost_of_living_us.to_sql('cost_index',  if_exists='replace', index=False, con=connection, method='multi')

In [15]:
#Create table 2 (salaries) in postgres database "Cost_Living"
census_clean.to_sql('salaries',  if_exists='replace', index=False, con=connection, method='multi')

In [16]:
#Create table 3 (weather) in postgres database "Cost_Living"
weather_data.to_sql('weather',  if_exists='replace', index=False, con=connection, method='multi')

In [17]:
#Verify tables can be read from postgress
cost_ind = pd.read_sql("select * from \"cost_index\"", connection)
cost_ind

              City  Cost of Living Index  Rent Index  Groceries Index State
0         New York                100.00      100.00           100.00    NY
1    San Francisco                 96.88      106.49           101.93    CA
2         Honolulu                 93.72       63.96            96.32    HI
3        Anchorage                 93.19       39.45            96.74    AK
4         Brooklyn                 90.31       81.02            83.16    NY
..             ...                   ...         ...              ...   ...
105     Huntsville                 59.80       28.65            58.83    AL
106      Lexington                 59.64       24.86            54.50    KY
107          Boise                 59.43       30.85            50.93    ID
108        El Paso                 59.37       22.16            54.07    TX
109    San Antonio                 58.12       31.26            55.20    TX

[110 rows x 5 columns]

In [18]:
#Verify tables can be read from postgress
salaries_ind = pd.read_sql("select * from \"salaries\"", connection)
salaries_ind

    Married Family Income Nonfamily Income                        City State
0                   66894            24470                    Aberdeen    WA
1                   76327            31515                     Abilene    TX
2                   76768            27484                      Adrian    MI
3                   26366            10876           Aguadilla-Isabela    PR
4                   94742            34936                       Akron    OH
..                    ...              ...                         ...   ...
514                 90574            36159                York-Hanover    PA
515                 76266            28248  Youngstown-Warren-Boardman    OH
516                 76119            35283                   Yuba City    CA
517                 55525            29631                        Yuma    AZ
518                 73074            28409                  Zanesville    OH

[519 rows x 4 columns]

In [19]:
#Verify tables can be read from postgress
weather_ind = pd.read_sql("select * from \"weather\"", connection)
weather_ind

              City  Maximum Temp  Minimum Temp  % Humidity
0         New York         62.69         46.92          82
1    San Francisco         64.45         50.72          75
2         Honolulu         84.02         78.31          61
3        Anchorage         40.93         34.65          65
4         Brooklyn         62.60         45.86          84
..             ...           ...           ...         ...
105     Huntsville         63.95         60.98          89
106      Lexington         62.73         58.93          70
107          Boise         57.02         51.71          41
108        El Paso         58.82         52.66          16
109    San Antonio         64.92         52.52          29

[110 rows x 4 columns]

In [20]:
#Joining the files together
joined_cities = census_clean.merge(Cost_of_living_us, on= ['City','State'], how= 'inner')
#joined_cities = joined_cities[['City', 'State', 'Married Family Income', 'Groceries Index', 'Rent Index','Cost of Living Index']]
joined_cities_fin  = joined_cities.merge(weather_data, on= ['City'])
joined_cities_fin = joined_cities_fin[['City', 'State', 'Married Family Income', 'Groceries Index', 'Rent Index','Cost of Living Index','Maximum Temp','% Humidity']]
joined_cities_fin

,City,State,Married Family Income,Groceries Index,Rent Index,Cost of Living Index,Maximum Temp,% Humidity
0,Albuquerque,NM,78972,64.42,27.29,64.32,56.68,12
1,Anchorage,AK,110718,96.74,39.45,93.19,40.93,65
2,Ann Arbor,MI,121746,60.70,47.59,67.06,47.59,92
3,Asheville,NC,80047,71.47,37.19,71.52,57.02,85
4,Bakersfield,CA,72016,63.16,28.95,67.11,71.85,32
5,Bellingham,WA,88044,68.93,34.17,72.14,52.14,78
6,Boulder,CO,126626,76.79,53.54,77.16,39.78,33
7,Chattanooga,TN,78729,57.19,29.58,63.28,60.24,94
8,Cincinnati,OH,97646,52.40,31.03,62.65,60.10,80
9,Columbia,SC,84012,65.60,27.73,66.23,60.28,90
10,Columbus,OH,96835,58.94,36.92,66.90,55.71,95
11,Dayton,OH,89819,62.60,21.97,65.84,59.49,87
12,El Paso,TX,59054,54.07,22.16,59.37,58.82,16
13,Eugene,OR,79981,78.36,30.44,72.46,55.38,71
14,Fort Wayne,IN,81714,70.07,21.74,65.88,55.06,96
15,Fresno,CA,76579,54.68,30.12,63.25,71.51,35
16,Gainesville,FL,90001,60.52,29.02,63.62,67.78,70
17,Huntsville,AL,94544,58.83,28.65,59.80,63.95,89
18,Jacksonville,FL,87124,69.00,31.36,70.62,67.05,79
19,Kansas City,MO,97602,58.43,30.53,65.74,42.62,80
20,Knoxville,TN,79738,59.45,28.75,60.97,62.29,82
21,Lubbock,TX,85243,56.80,24.28,62.40,53.85,26
22,Madison,WI,105028,56.66,37.52,63.30,63.52,89
23,Memphis,TN,85835,59.36,26.58,66.49,53.73,65
24,Oklahoma City,OK,84051,60.18,25.72,61.72,49.86,51
25,Peoria,IL,83793,68.44,25.55,69.84,45.45,71
26,Pittsburgh,PA,93806,71.89,38.23,76.04,65.05,84
27,Raleigh,NC,107570,71.88,36.18,69.18,69.22,71
28,Reno,NV,93613,51.96,38.03,59.84,62.26,29
29,Richmond,VA,105593,63.54,35.24,64.56,66.22,67
30,Rochester,NY,94316,69.88,30.81,70.25,50.41,84
31,Salem,OR,79621,61.63,28.93,66.04,77.20,50
32,Salt Lake City,UT,99414,55.93,35.80,62.94,51.10,42
33,Santa Rosa,CA,114073,84.35,56.69,88.27,89.02,67
34,Springfield,MO,71053,60.68,18.66,60.56,39.43,93
35,Syracuse,NY,92011,63.81,33.60,67.55,54.77,81
36,Tallahassee,FL,89270,71.30,26.47,67.24,62.85,82
37,Toledo,OH,85221,50.89,21.26,60.35,43.36,88
38,Tucson,AZ,80367,52.48,23.63,63.35,71.98,10
39,Tulsa,OK,83346,59.49,26.87,62.67,48.70,60
40,Wichita,KS,84799,57.30,23.45,63.18,48.36,62

In [21]:
#close connection
connection.close()